; domain
(define (domain Depot)
(:requirements :typing)
(:types place locatable - object
	depot distributor - place
        truck hoist surface - locatable
        pallet crate - surface)

(:predicates (at ?x - locatable ?y - place) 
             (on ?x - crate ?y - surface)
             (in ?x - crate ?y - truck)
             (lifting ?x - hoist ?y - crate)
             (available ?x - hoist)
             (clear ?x - surface))
	
(:action Drive
:parameters (?x - truck ?y - place ?z - place) 
:precondition (and (at ?x ?y))
:effect (and (not (at ?x ?y)) (at ?x ?z)))

(:action Lift
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (available ?x) (at ?y ?p) (on ?y ?z) (clear ?y))
:effect (and (not (at ?y ?p)) (lifting ?x ?y) (not (clear ?y)) (not (available ?x)) 
             (clear ?z) (not (on ?y ?z))))

(:action Drop 
:parameters (?x - hoist ?y - crate ?z - surface ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (clear ?z) (lifting ?x ?y))
:effect (and (available ?x) (not (lifting ?x ?y)) (at ?y ?p) (not (clear ?z)) (clear ?y)
		(on ?y ?z)))

(:action Load
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (lifting ?x ?y))
:effect (and (not (lifting ?x ?y)) (in ?y ?z) (available ?x)))

(:action Unload 
:parameters (?x - hoist ?y - crate ?z - truck ?p - place)
:precondition (and (at ?x ?p) (at ?z ?p) (available ?x) (in ?y ?z))
:effect (and (not (in ?y ?z)) (not (available ?x)) (lifting ?x ?y)))

)

; problem
(define (problem depotprobu1818) (:domain Depot)
(:objects
	depot0 depot1 depot2 depot3 depot4 depot5 depot6 depot7 depot8 depot9 - Depot
	distributor0 distributor1 distributor2 distributor3 distributor4 distributor5 distributor6 distributor7 distributor8 distributor9 - Distributor
	truck0 truck1 truck2 truck3 truck4 truck5 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 pallet9 pallet10 pallet11 pallet12 pallet13 pallet14 pallet15 pallet16 pallet17 pallet18 pallet19 pallet20 pallet21 pallet22 pallet23 pallet24 pallet25 pallet26 pallet27 pallet28 pallet29 - Pallet
	crate0 crate1 crate2 crate3 crate4 crate5 crate6 crate7 crate8 crate9 crate10 crate11 crate12 crate13 crate14 crate15 crate16 crate17 crate18 crate19 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 hoist9 hoist10 hoist11 hoist12 hoist13 hoist14 hoist15 hoist16 hoist17 hoist18 hoist19 hoist20 hoist21 hoist22 hoist23 hoist24 hoist25 hoist26 hoist27 hoist28 hoist29 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear pallet1)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 depot3)
	(clear pallet3)
	(at pallet4 depot4)
	(clear crate12)
	(at pallet5 depot5)
	(clear pallet5)
	(at pallet6 depot6)
	(clear crate11)
	(at pallet7 depot7)
	(clear crate16)
	(at pallet8 depot8)
	(clear pallet8)
	(at pallet9 depot9)
	(clear crate19)
	(at pallet10 distributor0)
	(clear crate18)
	(at pallet11 distributor1)
	(clear crate1)
	(at pallet12 distributor2)
	(clear pallet12)
	(at pallet13 distributor3)
	(clear crate9)
	(at pallet14 distributor4)
	(clear crate10)
	(at pallet15 distributor5)
	(clear pallet15)
	(at pallet16 distributor6)
	(clear crate4)
	(at pallet17 distributor7)
	(clear crate2)
	(at pallet18 distributor8)
	(clear pallet18)
	(at pallet19 distributor9)
	(clear crate5)
	(at pallet20 depot6)
	(clear pallet20)
	(at pallet21 distributor9)
	(clear crate6)
	(at pallet22 depot7)
	(clear pallet22)
	(at pallet23 distributor1)
	(clear pallet23)
	(at pallet24 distributor4)
	(clear pallet24)
	(at pallet25 distributor9)
	(clear crate14)
	(at pallet26 distributor7)
	(clear pallet26)
	(at pallet27 distributor4)
	(clear crate17)
	(at pallet28 distributor3)
	(clear crate15)
	(at pallet29 depot7)
	(clear crate8)
	(at truck0 depot6)
	(at truck1 distributor9)
	(at truck2 depot1)
	(at truck3 distributor3)
	(at truck4 distributor5)
	(at truck5 depot3)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 depot4)
	(available hoist4)
	(at hoist5 depot5)
	(available hoist5)
	(at hoist6 depot6)
	(available hoist6)
	(at hoist7 depot7)
	(available hoist7)
	(at hoist8 depot8)
	(available hoist8)
	(at hoist9 depot9)
	(available hoist9)
	(at hoist10 distributor0)
	(available hoist10)
	(at hoist11 distributor1)
	(available hoist11)
	(at hoist12 distributor2)
	(available hoist12)
	(at hoist13 distributor3)
	(available hoist13)
	(at hoist14 distributor4)
	(available hoist14)
	(at hoist15 distributor5)
	(available hoist15)
	(at hoist16 distributor6)
	(available hoist16)
	(at hoist17 distributor7)
	(available hoist17)
	(at hoist18 distributor8)
	(available hoist18)
	(at hoist19 distributor9)
	(available hoist19)
	(at hoist20 depot5)
	(available hoist20)
	(at hoist21 depot1)
	(available hoist21)
	(at hoist22 distributor7)
	(available hoist22)
	(at hoist23 distributor2)
	(available hoist23)
	(at hoist24 distributor4)
	(available hoist24)
	(at hoist25 depot6)
	(available hoist25)
	(at hoist26 depot5)
	(available hoist26)
	(at hoist27 distributor1)
	(available hoist27)
	(at hoist28 distributor9)
	(available hoist28)
	(at hoist29 depot9)
	(available hoist29)
	(at crate0 distributor9)
	(on crate0 pallet25)
	(at crate1 distributor1)
	(on crate1 pallet11)
	(at crate2 distributor7)
	(on crate2 pallet17)
	(at crate3 distributor3)
	(on crate3 pallet13)
	(at crate4 distributor6)
	(on crate4 pallet16)
	(at crate5 distributor9)
	(on crate5 pallet19)
	(at crate6 distributor9)
	(on crate6 pallet21)
	(at crate7 distributor3)
	(on crate7 pallet28)
	(at crate8 depot7)
	(on crate8 pallet29)
	(at crate9 distributor3)
	(on crate9 crate3)
	(at crate10 distributor4)
	(on crate10 pallet14)
	(at crate11 depot6)
	(on crate11 pallet6)
	(at crate12 depot4)
	(on crate12 pallet4)
	(at crate13 distributor3)
	(on crate13 crate7)
	(at crate14 distributor9)
	(on crate14 crate0)
	(at crate15 distributor3)
	(on crate15 crate13)
	(at crate16 depot7)
	(on crate16 pallet7)
	(at crate17 distributor4)
	(on crate17 pallet27)
	(at crate18 distributor0)
	(on crate18 pallet10)
	(at crate19 depot9)
	(on crate19 pallet9)
)

(:goal (and
		(on crate0 pallet11)
		(on crate1 pallet22)
		(on crate2 pallet12)
		(on crate3 pallet26)
		(on crate4 crate17)
		(on crate5 crate18)
		(on crate6 pallet7)
		(on crate7 pallet15)
		(on crate8 pallet1)
		(on crate9 crate11)
		(on crate10 crate19)
		(on crate11 pallet23)
		(on crate12 crate4)
		(on crate15 pallet9)
		(on crate16 pallet8)
		(on crate17 pallet18)
		(on crate18 pallet25)
		(on crate19 pallet5)
	)
))

; plan
1. (lift hoist10 crate18 pallet10 distributor0)
   deleted: (at crate18 distributor0) (clear crate18) (available hoist10) (on crate18 pallet10)
   added: (lifting hoist10 crate18) (clear pallet10)
   goals met: 0 of 18
2. (lift hoist11 crate1 pallet11 distributor1)
   deleted: (at crate1 distributor1) (clear crate1) (available hoist11) (on crate1 pallet11)
   added: (lifting hoist11 crate1) (clear pallet11)
   goals met: 0 of 18
3. (lift hoist13 crate15 crate13 distributor3)
   deleted: (at crate15 distributor3) (clear crate15) (available hoist13) (on crate15 crate13)
   added: (lifting hoist13 crate15) (clear crate13)
   goals met: 0 of 18
4. (lift hoist14 crate10 pallet14 distributor4)
   deleted: (at crate10 distributor4) (clear crate10) (available hoist14) (on crate10 pallet14)
   added: (lifting hoist14 crate10) (clear pallet14)
   goals met: 0 of 18
5. (lift hoist16 crate4 pallet16 distributor6)
   deleted: (at crate4 distributor6) (clear crate4) (available hoist16) (on crate4 pallet16)
   added: (lifting hoist16 crate4) (clear pallet16)
   goals met: 0 of 18
6. (lift hoist17 crate2 pallet17 distributor7)
   deleted: (at crate2 distributor7) (clear crate2) (available hoist17) (on crate2 pallet17)
   added: (lifting hoist17 crate2) (clear pallet17)
   goals met: 0 of 18
7. (lift hoist19 crate6 pallet21 distributor9)
   deleted: (at crate6 distributor9) (clear crate6) (available hoist19) (on crate6 pallet21)
   added: (lifting hoist19 crate6) (clear pallet21)
   goals met: 0 of 18
8. (lift hoist25 crate11 pallet6 depot6)
   deleted: (at crate11 depot6) (clear crate11) (available hoist25) (on crate11 pallet6)
   added: (lifting hoist25 crate11) (clear pallet6)
   goals met: 0 of 18
9. (lift hoist29 crate19 pallet9 depot9)
   deleted: (at crate19 depot9) (clear crate19) (available hoist29) (on crate19 pallet9)
   added: (lifting hoist29 crate19) (clear pallet9)
   goals met: 0 of 18
10. (lift hoist4 crate12 pallet4 depot4)
   deleted: (at crate12 depot4) (clear crate12) (available hoist4) (on crate12 pallet4)
   added: (lifting hoist4 crate12) (clear pallet4)
   goals met: 0 of 18
11. (lift hoist7 crate16 pallet7 depot7)
   deleted: (at crate16 depot7) (clear crate16) (available hoist7) (on crate16 pallet7)
   added: (lifting hoist7 crate16) (clear pallet7)
   goals met: 0 of 18
12. (load hoist13 crate15 truck3 distributor3)
   deleted: (lifting hoist13 crate15)
   added: (in crate15 truck3) (available hoist13)
   goals met: 0 of 18
13. (lift hoist13 crate9 crate3 distributor3)
   deleted: (at crate9 distributor3) (clear crate9) (available hoist13) (on crate9 crate3)
   added: (lifting hoist13 crate9) (clear crate3)
   goals met: 0 of 18
14. (load hoist13 crate9 truck3 distributor3)
   deleted: (lifting hoist13 crate9)
   added: (in crate9 truck3) (available hoist13)
   goals met: 0 of 18
15. (lift hoist13 crate3 pallet13 distributor3)
   deleted: (at crate3 distributor3) (clear crate3) (available hoist13) (on crate3 pallet13)
   added: (lifting hoist13 crate3) (clear pallet13)
   goals met: 0 of 18
16. (load hoist13 crate3 truck3 distributor3)
   deleted: (lifting hoist13 crate3)
   added: (in crate3 truck3) (available hoist13)
   goals met: 0 of 18
17. (lift hoist13 crate13 crate7 distributor3)
   deleted: (at crate13 distributor3) (clear crate13) (available hoist13) (on crate13 crate7)
   added: (lifting hoist13 crate13) (clear crate7)
   goals met: 0 of 18
18. (drop hoist13 crate13 pallet13 distributor3)
   deleted: (lifting hoist13 crate13) (clear pallet13)
   added: (available hoist13) (at crate13 distributor3) (clear crate13) (on crate13 pallet13)
   goals met: 0 of 18
19. (lift hoist13 crate7 pallet28 distributor3)
   deleted: (at crate7 distributor3) (clear crate7) (available hoist13) (on crate7 pallet28)
   added: (lifting hoist13 crate7) (clear pallet28)
   goals met: 0 of 18
20. (load hoist13 crate7 truck3 distributor3)
   deleted: (lifting hoist13 crate7)
   added: (in crate7 truck3) (available hoist13)
   goals met: 0 of 18
21. (load hoist19 crate6 truck1 distributor9)
   deleted: (lifting hoist19 crate6)
   added: (in crate6 truck1) (available hoist19)
   goals met: 0 of 18
22. (lift hoist19 crate14 crate0 distributor9)
   deleted: (at crate14 distributor9) (clear crate14) (available hoist19) (on crate14 crate0)
   added: (lifting hoist19 crate14) (clear crate0)
   goals met: 0 of 18
23. (drop hoist19 crate14 crate5 distributor9)
   deleted: (lifting hoist19 crate14) (clear crate5)
   added: (available hoist19) (at crate14 distributor9) (clear crate14) (on crate14 crate5)
   goals met: 0 of 18
24. (lift hoist19 crate0 pallet25 distributor9)
   deleted: (at crate0 distributor9) (clear crate0) (available hoist19) (on crate0 pallet25)
   added: (lifting hoist19 crate0) (clear pallet25)
   goals met: 0 of 18
25. (load hoist19 crate0 truck1 distributor9)
   deleted: (lifting hoist19 crate0)
   added: (in crate0 truck1) (available hoist19)
   goals met: 0 of 18
26. (load hoist25 crate11 truck0 depot6)
   deleted: (lifting hoist25 crate11)
   added: (in crate11 truck0) (available hoist25)
   goals met: 0 of 18
27. (drive truck0 depot6 depot4)
   deleted: (at truck0 depot6)
   added: (at truck0 depot4)
   goals met: 0 of 18
28. (load hoist4 crate12 truck0 depot4)
   deleted: (lifting hoist4 crate12)
   added: (in crate12 truck0) (available hoist4)
   goals met: 0 of 18
29. (drive truck0 depot4 depot7)
   deleted: (at truck0 depot4)
   added: (at truck0 depot7)
   goals met: 0 of 18
30. (load hoist7 crate16 truck0 depot7)
   deleted: (lifting hoist7 crate16)
   added: (in crate16 truck0) (available hoist7)
   goals met: 0 of 18
31. (lift hoist7 crate8 pallet29 depot7)
   deleted: (at crate8 depot7) (clear crate8) (available hoist7) (on crate8 pallet29)
   added: (lifting hoist7 crate8) (clear pallet29)
   goals met: 0 of 18
32. (load hoist7 crate8 truck0 depot7)
   deleted: (lifting hoist7 crate8)
   added: (in crate8 truck0) (available hoist7)
   goals met: 0 of 18
33. (drive truck0 depot7 depot1)
   deleted: (at truck0 depot7)
   added: (at truck0 depot1)
   goals met: 0 of 18
34. (unload hoist1 crate8 truck0 depot1)
   deleted: (in crate8 truck0) (available hoist1)
   added: (lifting hoist1 crate8)
   goals met: 0 of 18
35. (drop hoist1 crate8 pallet1 depot1)
   deleted: (lifting hoist1 crate8) (clear pallet1)
   added: (available hoist1) (at crate8 depot1) (clear crate8) (on crate8 pallet1)
   goals met: 1 of 18
36. (drive truck0 depot1 depot8)
   deleted: (at truck0 depot1)
   added: (at truck0 depot8)
   goals met: 1 of 18
37. (unload hoist8 crate16 truck0 depot8)
   deleted: (in crate16 truck0) (available hoist8)
   added: (lifting hoist8 crate16)
   goals met: 1 of 18
38. (drop hoist8 crate16 pallet8 depot8)
   deleted: (lifting hoist8 crate16) (clear pallet8)
   added: (available hoist8) (at crate16 depot8) (clear crate16) (on crate16 pallet8)
   goals met: 2 of 18
39. (drive truck0 depot8 depot9)
   deleted: (at truck0 depot8)
   added: (at truck0 depot9)
   goals met: 2 of 18
40. (load hoist29 crate19 truck0 depot9)
   deleted: (lifting hoist29 crate19)
   added: (in crate19 truck0) (available hoist29)
   goals met: 2 of 18
41. (drive truck0 depot9 depot5)
   deleted: (at truck0 depot9)
   added: (at truck0 depot5)
   goals met: 2 of 18
42. (unload hoist20 crate19 truck0 depot5)
   deleted: (in crate19 truck0) (available hoist20)
   added: (lifting hoist20 crate19)
   goals met: 2 of 18
43. (drop hoist20 crate19 pallet5 depot5)
   deleted: (lifting hoist20 crate19) (clear pallet5)
   added: (available hoist20) (at crate19 depot5) (clear crate19) (on crate19 pallet5)
   goals met: 3 of 18
44. (drive truck0 depot5 distributor0)
   deleted: (at truck0 depot5)
   added: (at truck0 distributor0)
   goals met: 3 of 18
45. (load hoist10 crate18 truck0 distributor0)
   deleted: (lifting hoist10 crate18)
   added: (in crate18 truck0) (available hoist10)
   goals met: 3 of 18
46. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 3 of 18
47. (load hoist11 crate1 truck0 distributor1)
   deleted: (lifting hoist11 crate1)
   added: (in crate1 truck0) (available hoist11)
   goals met: 3 of 18
48. (unload hoist11 crate11 truck0 distributor1)
   deleted: (in crate11 truck0) (available hoist11)
   added: (lifting hoist11 crate11)
   goals met: 3 of 18
49. (drop hoist11 crate11 pallet23 distributor1)
   deleted: (lifting hoist11 crate11) (clear pallet23)
   added: (available hoist11) (at crate11 distributor1) (clear crate11) (on crate11 pallet23)
   goals met: 4 of 18
50. (drive truck0 distributor1 depot7)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot7)
   goals met: 4 of 18
51. (unload hoist7 crate1 truck0 depot7)
   deleted: (in crate1 truck0) (available hoist7)
   added: (lifting hoist7 crate1)
   goals met: 4 of 18
52. (drop hoist7 crate1 pallet22 depot7)
   deleted: (lifting hoist7 crate1) (clear pallet22)
   added: (available hoist7) (at crate1 depot7) (clear crate1) (on crate1 pallet22)
   goals met: 5 of 18
53. (drive truck0 depot7 distributor4)
   deleted: (at truck0 depot7)
   added: (at truck0 distributor4)
   goals met: 5 of 18
54. (load hoist14 crate10 truck0 distributor4)
   deleted: (lifting hoist14 crate10)
   added: (in crate10 truck0) (available hoist14)
   goals met: 5 of 18
55. (lift hoist14 crate17 pallet27 distributor4)
   deleted: (at crate17 distributor4) (clear crate17) (available hoist14) (on crate17 pallet27)
   added: (lifting hoist14 crate17) (clear pallet27)
   goals met: 5 of 18
56. (load hoist14 crate17 truck0 distributor4)
   deleted: (lifting hoist14 crate17)
   added: (in crate17 truck0) (available hoist14)
   goals met: 5 of 18
57. (drive truck0 distributor4 depot5)
   deleted: (at truck0 distributor4)
   added: (at truck0 depot5)
   goals met: 5 of 18
58. (unload hoist20 crate10 truck0 depot5)
   deleted: (in crate10 truck0) (available hoist20)
   added: (lifting hoist20 crate10)
   goals met: 5 of 18
59. (drop hoist20 crate10 crate19 depot5)
   deleted: (lifting hoist20 crate10) (clear crate19)
   added: (available hoist20) (at crate10 depot5) (clear crate10) (on crate10 crate19)
   goals met: 6 of 18
60. (drive truck0 depot5 distributor6)
   deleted: (at truck0 depot5)
   added: (at truck0 distributor6)
   goals met: 6 of 18
61. (load hoist16 crate4 truck0 distributor6)
   deleted: (lifting hoist16 crate4)
   added: (in crate4 truck0) (available hoist16)
   goals met: 6 of 18
62. (drive truck0 distributor6 distributor7)
   deleted: (at truck0 distributor6)
   added: (at truck0 distributor7)
   goals met: 6 of 18
63. (load hoist17 crate2 truck0 distributor7)
   deleted: (lifting hoist17 crate2)
   added: (in crate2 truck0) (available hoist17)
   goals met: 6 of 18
64. (drive truck0 distributor7 distributor2)
   deleted: (at truck0 distributor7)
   added: (at truck0 distributor2)
   goals met: 6 of 18
65. (unload hoist12 crate2 truck0 distributor2)
   deleted: (in crate2 truck0) (available hoist12)
   added: (lifting hoist12 crate2)
   goals met: 6 of 18
66. (drop hoist12 crate2 pallet12 distributor2)
   deleted: (lifting hoist12 crate2) (clear pallet12)
   added: (available hoist12) (at crate2 distributor2) (clear crate2) (on crate2 pallet12)
   goals met: 7 of 18
67. (drive truck0 distributor2 distributor8)
   deleted: (at truck0 distributor2)
   added: (at truck0 distributor8)
   goals met: 7 of 18
68. (unload hoist18 crate17 truck0 distributor8)
   deleted: (in crate17 truck0) (available hoist18)
   added: (lifting hoist18 crate17)
   goals met: 7 of 18
69. (drop hoist18 crate17 pallet18 distributor8)
   deleted: (lifting hoist18 crate17) (clear pallet18)
   added: (available hoist18) (at crate17 distributor8) (clear crate17) (on crate17 pallet18)
   goals met: 8 of 18
70. (unload hoist18 crate4 truck0 distributor8)
   deleted: (in crate4 truck0) (available hoist18)
   added: (lifting hoist18 crate4)
   goals met: 8 of 18
71. (drop hoist18 crate4 crate17 distributor8)
   deleted: (lifting hoist18 crate4) (clear crate17)
   added: (available hoist18) (at crate4 distributor8) (clear crate4) (on crate4 crate17)
   goals met: 9 of 18
72. (unload hoist18 crate12 truck0 distributor8)
   deleted: (in crate12 truck0) (available hoist18)
   added: (lifting hoist18 crate12)
   goals met: 9 of 18
73. (drop hoist18 crate12 crate4 distributor8)
   deleted: (lifting hoist18 crate12) (clear crate4)
   added: (available hoist18) (at crate12 distributor8) (clear crate12) (on crate12 crate4)
   goals met: 10 of 18
74. (drive truck0 distributor8 distributor9)
   deleted: (at truck0 distributor8)
   added: (at truck0 distributor9)
   goals met: 10 of 18
75. (unload hoist19 crate18 truck0 distributor9)
   deleted: (in crate18 truck0) (available hoist19)
   added: (lifting hoist19 crate18)
   goals met: 10 of 18
76. (drop hoist19 crate18 pallet25 distributor9)
   deleted: (lifting hoist19 crate18) (clear pallet25)
   added: (available hoist19) (at crate18 distributor9) (clear crate18) (on crate18 pallet25)
   goals met: 11 of 18
77. (lift hoist19 crate14 crate5 distributor9)
   deleted: (at crate14 distributor9) (clear crate14) (available hoist19) (on crate14 crate5)
   added: (lifting hoist19 crate14) (clear crate5)
   goals met: 11 of 18
78. (drop hoist19 crate14 pallet21 distributor9)
   deleted: (lifting hoist19 crate14) (clear pallet21)
   added: (available hoist19) (at crate14 distributor9) (clear crate14) (on crate14 pallet21)
   goals met: 11 of 18
79. (lift hoist19 crate5 pallet19 distributor9)
   deleted: (at crate5 distributor9) (clear crate5) (available hoist19) (on crate5 pallet19)
   added: (lifting hoist19 crate5) (clear pallet19)
   goals met: 11 of 18
80. (drop hoist19 crate5 crate18 distributor9)
   deleted: (lifting hoist19 crate5) (clear crate18)
   added: (available hoist19) (at crate5 distributor9) (clear crate5) (on crate5 crate18)
   goals met: 12 of 18
81. (drive truck1 distributor9 depot7)
   deleted: (at truck1 distributor9)
   added: (at truck1 depot7)
   goals met: 12 of 18
82. (unload hoist7 crate6 truck1 depot7)
   deleted: (in crate6 truck1) (available hoist7)
   added: (lifting hoist7 crate6)
   goals met: 12 of 18
83. (drop hoist7 crate6 pallet7 depot7)
   deleted: (lifting hoist7 crate6) (clear pallet7)
   added: (available hoist7) (at crate6 depot7) (clear crate6) (on crate6 pallet7)
   goals met: 13 of 18
84. (drive truck1 depot7 distributor1)
   deleted: (at truck1 depot7)
   added: (at truck1 distributor1)
   goals met: 13 of 18
85. (unload hoist11 crate0 truck1 distributor1)
   deleted: (in crate0 truck1) (available hoist11)
   added: (lifting hoist11 crate0)
   goals met: 13 of 18
86. (drop hoist11 crate0 pallet11 distributor1)
   deleted: (lifting hoist11 crate0) (clear pallet11)
   added: (available hoist11) (at crate0 distributor1) (clear crate0) (on crate0 pallet11)
   goals met: 14 of 18
87. (drive truck3 distributor3 depot9)
   deleted: (at truck3 distributor3)
   added: (at truck3 depot9)
   goals met: 14 of 18
88. (unload hoist29 crate15 truck3 depot9)
   deleted: (in crate15 truck3) (available hoist29)
   added: (lifting hoist29 crate15)
   goals met: 14 of 18
89. (drop hoist29 crate15 pallet9 depot9)
   deleted: (lifting hoist29 crate15) (clear pallet9)
   added: (available hoist29) (at crate15 depot9) (clear crate15) (on crate15 pallet9)
   goals met: 15 of 18
90. (drive truck3 depot9 distributor1)
   deleted: (at truck3 depot9)
   added: (at truck3 distributor1)
   goals met: 15 of 18
91. (unload hoist11 crate9 truck3 distributor1)
   deleted: (in crate9 truck3) (available hoist11)
   added: (lifting hoist11 crate9)
   goals met: 15 of 18
92. (drop hoist11 crate9 crate11 distributor1)
   deleted: (lifting hoist11 crate9) (clear crate11)
   added: (available hoist11) (at crate9 distributor1) (clear crate9) (on crate9 crate11)
   goals met: 16 of 18
93. (drive truck3 distributor1 distributor5)
   deleted: (at truck3 distributor1)
   added: (at truck3 distributor5)
   goals met: 16 of 18
94. (unload hoist15 crate7 truck3 distributor5)
   deleted: (in crate7 truck3) (available hoist15)
   added: (lifting hoist15 crate7)
   goals met: 16 of 18
95. (drop hoist15 crate7 pallet15 distributor5)
   deleted: (lifting hoist15 crate7) (clear pallet15)
   added: (available hoist15) (at crate7 distributor5) (clear crate7) (on crate7 pallet15)
   goals met: 17 of 18
96. (drive truck3 distributor5 distributor7)
   deleted: (at truck3 distributor5)
   added: (at truck3 distributor7)
   goals met: 17 of 18
97. (unload hoist17 crate3 truck3 distributor7)
   deleted: (in crate3 truck3) (available hoist17)
   added: (lifting hoist17 crate3)
   goals met: 17 of 18
98. (drop hoist17 crate3 pallet26 distributor7)
   deleted: (lifting hoist17 crate3) (clear pallet26)
   added: (available hoist17) (at crate3 distributor7) (clear crate3) (on crate3 pallet26)
   goals met: 18 of 18
